#include "lecture.h"

/*
* 변수	: 값을 담는 공간 (데이터 타입에 따라 정수, 실수로 담을 수 있다)
* 변하는 수를 컴퓨터에게 전달하기 위해서
*
* 전역 변수가 더 큰 범위이다.
*
* 지역 (local)	: 더 가깝다.
* 전역 (global)	: 더 멀다.
*
* 1. 지역 변수가 전역 변수보다 가까이 있기 때문에 먼저 사용된다.
*/

/*
* 함수 내부에 선언된다 -> 지역 변수
* 함수 외부에 선언된다 -> 전역 변수
*
* 함수
* 반환값 이름(){}

* { } 내부에 변수가 선언되면 지역 변수이다.
* { } 외부에 변수가 선언되면 전역 변수이다.
*/

/*
* 이름이 같은데 왜 에러가 발생이 안될까?
* 컴퓨터가 이름이 같아도 구분할 수 있는 방법이 뭐가 있을까?
* 메모리 - 저장하는 공간이 구분되어 있다.
* 코드 영역 - 데이터 영역 - 힙 영역 - 스택 영역
*
* 전역 변수는 데이터 영역
* 지역 변수는 스택 영역
*
* 전역 변수와 지역 변수는 저장되는 영역이 다르기 때문에 구별할 수 있다.
*/

/*
* 영역을 나누는 이유
*
* 지역 변수의 특징
* 1. 함수 내부에서 선언된다.
* 2. 함수가 종료되는 시점에 변수가 소멸된다.
*
* 전역 변수의 특징
* 1. 함수 외부에서 선언된다.
* 2. 프로그램이 종료되는 시점에서 변수가 소멸된다.
*/

/*
* 변수가 소멸되는 시점이 다른 이유
*
* 메모리를 효율적으로 사용하기 위해서
* 사용한 공간을 지워서 다시 만든다.
*
* 지역 변수는 함수가 종료될 때 소멸된다.
* => 함수가 종료되면 안쓰는 메모리를 지운다.
* 함수가 호출될 때 지역변수가 생성되고 끝날 때 소멸된다.
*/

// 지역 변수와 전역 변수의 이름이 같을 때 구분하는 방법 
// 1. main 함수 안에 정의된 변수를 주석처리한다.
// 2. main 함수 안에 정의된 변수 이름을 바꾼다. ex) number = 10; -> number2 = 10;

/*
* 전역 변수		||		main 함수		||		LocalFunc 함수
*
* number		||		number2			||		value
*
* 소멸 순서
* 3				||			2			||			1
*/

void ShowExample()
{
	int number = 10;

	printf("number의 값 : %d\n", number);

	LocalFunc(10);	// 생성과 소멸이 반복되고 있다. (함수 내부의 변수가 생성과 소멸을 반복한다.)
	LocalFunc(15);
}

void LocalFunc(int a)
{
	// 만약에 함수가 종료될 때 소멸되지 않으면 어떤 일이 일어날까?

	int value = 5;
	printf("a의 값에 5를 더한 값 : %d\n", a + value);
	value += 10;
}